
    const n = 20

    if (2 % 2 === 0) {
        return "เลขคู่"
    } else {
        return "เลขขี้"
    }


    function Counter() {

    return(
        //แฟคเม้น <></>
    <>
        <div>{count}</div>
        <div>{1+1}</div>

//if-else ใช้ไม่ได้เพราะ มันคำนวนแล้วไม่ได้ค่า เป็นประโยคบอกเล่า เป็น จริงแล้วทำอะไรต่อ
        {/* <div>{
                if (2 % 2 === 0) {
                    return "เลขคู่"
                } else {
                    return "เลขขี่"
                }
            }  
        </div> */}


//ใช้ Ternary Operator ได้
//ใน {} ใส่ได้แต่ Expression(นิพจน์) เท่านั้น
// นิพจน์ คือ การนำข้อมูลซึ่งอาจอยู่ในรูปค่าคงที่หรือตัวแปรมาดำเนินการโดยใช้เครื่องหมายต่างๆเป็นตัวสั่งงาน สำหรับนิพจน์ที่เราพบเห็นกันทั่วไป เช่น 5+ 3 = 8
        <div>{n % 2 === 0 ? "เลขคู่" : "เลขขี"}</div>
        <button onclick = {() => setCount(count + 1)}>inc</button>
    </>
    
    )
}